RIOT-OS/RIOT/cpu/saml21/include/atmel/saml21e15a.h
/**
 * \file
 *
 * \brief Header file for SAML21E15A
 *
 * Copyright (c) 2014-2015 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="http://www.atmel.com/design-support/">Atmel Support</a>
 */

#ifndef SAML21E15A_H
#define SAML21E15A_H

/**
 * \ingroup SAML21_definitions
 * \addtogroup SAML21E15A_definitions SAML21E15A definitions
 * This file defines all structures and symbols for SAML21E15A:
 *   - registers and bitfields
 *   - peripheral base address
 *   - peripheral ID
 *   - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>
#ifndef __cplusplus
typedef volatile const uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile const uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile const uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#else
typedef volatile       uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile       uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile       uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#endif
typedef volatile       uint32_t WoReg;   /**< Write only 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t WoReg16; /**< Write only 16-bit register (volatile unsigned int) */
typedef volatile       uint32_t WoReg8;  /**< Write only  8-bit register (volatile unsigned int) */
typedef volatile       uint32_t RwReg;   /**< Read-Write 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t RwReg16; /**< Read-Write 16-bit register (volatile unsigned int) */
typedef volatile       uint8_t  RwReg8;  /**< Read-Write  8-bit register (volatile unsigned int) */
#define CAST(type, value) ((type *)(value))
#define REG_ACCESS(type, address) (*(type*)(address)) /**< C code: Register value */
#else
#define CAST(type, value) (value)
#define REG_ACCESS(type, address) (address) /**< Assembly code: Register address */
#endif

/* ************************************************************************** */
/**  CMSIS DEFINITIONS FOR SAML21E15A */
/* ************************************************************************** */
/** \defgroup SAML21E15A_cmsis CMSIS Definitions */
/*@{*/

/** Interrupt Number Definition */
typedef enum IRQn
{
  /******  Cortex-M0+ Processor Exceptions Numbers ******************************/
  NonMaskableInt_IRQn      = -14,/**<  2 Non Maskable Interrupt                 */
  HardFault_IRQn           = -13,/**<  3 Cortex-M0+ Hard Fault Interrupt        */
  SVCall_IRQn              = -5, /**< 11 Cortex-M0+ SV Call Interrupt           */
  PendSV_IRQn              = -2, /**< 14 Cortex-M0+ Pend SV Interrupt           */
  SysTick_IRQn             = -1, /**< 15 Cortex-M0+ System Tick Interrupt       */
  /******  SAML21E15A-specific Interrupt Numbers ***********************/
  SYSTEM_IRQn              =  0, /**<  0 SAML21E15A System Interrupts */
  MCLK_IRQn                =  0, /**<  0 SAML21E15A Main Clock (MCLK) */
  OSCCTRL_IRQn             =  0, /**<  0 SAML21E15A Oscillators Control (OSCCTRL) */
  OSC32KCTRL_IRQn          =  0, /**<  0 SAML21E15A 32k Oscillators Control (OSC32KCTRL) */
  PAC_IRQn                 =  0, /**<  0 SAML21E15A Peripheral Access Controller (PAC) */
  PM_IRQn                  =  0, /**<  0 SAML21E15A Power Manager (PM) */
  SUPC_IRQn                =  0, /**<  0 SAML21E15A Supply Controller (SUPC) */
  TAL_IRQn                 =  0, /**<  0 SAML21E15A Trigger Allocator (TAL) */
  WDT_IRQn                 =  1, /**<  1 SAML21E15A Watchdog Timer (WDT) */
  RTC_IRQn                 =  2, /**<  2 SAML21E15A Real-Time Counter (RTC) */
  EIC_IRQn                 =  3, /**<  3 SAML21E15A External Interrupt Controller (EIC) */
  NVMCTRL_IRQn             =  4, /**<  4 SAML21E15A Non-Volatile Memory Controller (NVMCTRL) */
  DMAC_IRQn                =  5, /**<  5 SAML21E15A Direct Memory Access Controller (DMAC) */
  USB_IRQn                 =  6, /**<  6 SAML21E15A Universal Serial Bus (USB) */
  EVSYS_IRQn               =  7, /**<  7 SAML21E15A Event System Interface (EVSYS) */
  SERCOM0_IRQn             =  8, /**<  8 SAML21E15A Serial Communication Interface 0 (SERCOM0) */
  SERCOM1_IRQn             =  9, /**<  9 SAML21E15A Serial Communication Interface 1 (SERCOM1) */
  SERCOM2_IRQn             = 10, /**< 10 SAML21E15A Serial Communication Interface 2 (SERCOM2) */
  SERCOM3_IRQn             = 11, /**< 11 SAML21E15A Serial Communication Interface 3 (SERCOM3) */
  TCC0_IRQn                = 14, /**< 14 SAML21E15A Timer Counter Control 0 (TCC0) */
  TCC1_IRQn                = 15, /**< 15 SAML21E15A Timer Counter Control 1 (TCC1) */
  TCC2_IRQn                = 16, /**< 16 SAML21E15A Timer Counter Control 2 (TCC2) */
  TC0_IRQn                 = 17, /**< 17 SAML21E15A Basic Timer Counter 0 (TC0) */
  TC1_IRQn                 = 18, /**< 18 SAML21E15A Basic Timer Counter 1 (TC1) */
  TC4_IRQn                 = 21, /**< 21 SAML21E15A Basic Timer Counter 4 (TC4) */
  ADC_IRQn                 = 22, /**< 22 SAML21E15A Analog Digital Converter (ADC) */
  AC_IRQn                  = 23, /**< 23 SAML21E15A Analog Comparators (AC) */
  DAC_IRQn                 = 24, /**< 24 SAML21E15A Digital-to-Analog Converter (DAC) */
  PTC_IRQn                 = 25, /**< 25 SAML21E15A Peripheral Touch Controller (PTC) */
  AES_IRQn                 = 26, /**< 26 SAML21E15A Advanced Encryption Standard (AES) */
  TRNG_IRQn                = 27, /**< 27 SAML21E15A True Random Generator (TRNG) */
  PICOP_IRQn               = 28, /**< 28 SAML21E15A PicoProcessor (PICOP) */

  PERIPH_COUNT_IRQn        = 29  /**< Number of peripheral IDs */
} IRQn_Type;

